from django.core.management.base import BaseCommand

from blog.models import BlogEntry


class Command(BaseCommand):
    help = 'Добавление данных в базу'

    def handle(self, *args, **kwargs):

        BlogEntry.objects.all().delete()

        entrys = [
            {'name': 'Декор для стены',
             'preview': 'blog/image/wall_decor.jpg',
             'created_at': '2000-05-10',
             'content': '''
                Хочешь оживить стену, но не готов к глобальному ремонту? Вот быстрые варианты:
                Галерея из постеров. Собери 3–5 плакатов в едином стиле получится цельная композиция.
                Макраме-панно. Добавит фактуры и уюта, особенно в сканди и бохо.
                Деревянные рейки. Простой способ создать геометрию и объём.
                Сухоцветы в рамках. Лёгкий природный акцент, который смотрится стильно и спокойно.
                Неоновая мини-вывеска. Добавит современный штрих и станет точкой притяжения взгляда.'''
             },
            {'name': 'Здоровье и фитнес',
             'preview': 'blog/image/Health_&_Fitness.PNG',
             'created_at': '2000-05-10',
             'content': '''
                Здоровье и фитнес это не про идеальные фото и рекорды, а про заботу о себе каждый день. Начните с 
                малого: 20 минут ходьбы, стакан воды утром, пять минут растяжки. Постепенно такие микропривычки 
                складываются в устойчивый ритм. Добавьте силовые упражнения 2–3 раза в неделю они укрепляют не 
                только мышцы, но и кости. Важен и баланс: качественный сон и осознанное питание работают не хуже 
                интенсивных тренировок. Помните: прогресс это путь, а не спринт. Двигайтесь в комфортном темпе и тело 
                обязательно скажет спасибо!'''
             },
            {'name': 'Технологии и гаджеты',
             'preview': 'blog/image/Technologies_and_gadgets.png',
             'created_at': '2000-05-10',
             'content': '''
                Технологии и гаджеты делают жизнь удобнее и каждый день удивляют новинками. Сейчас в тренде компактные 
                устройства с ИИ: умные колонки, очки дополненной реальности, трекеры здоровья. 
                Обратите внимание на энергоэффективность и экоматериалы производители всё чаще делают ставку на 
                устойчивость. А ещё круто, когда гаджеты легко интегрируются в умный дом и управляются голосом или 
                жестами. Какой гаджет стал вашим незаменимым помощником? Расскажите в комментариях соберём 
                топ любимых устройств! '''
             },
            {'name': 'Путешествия и туризм',
             'preview': 'blog/image/Travel_&_Tourism.jpg',
             'created_at': '2000-05-10',
             'content': '''
                Путешествия это не просто смена локаций, а возможность увидеть мир по‑новому. Пробуйте 
                нестандартные маршруты: вместо топ‑достопримечательностей исследуйте тихие улочки и местные рынки
                там живёт настоящий дух города. Отправляйтесь в мини‑походы, открывайте маленькие города, 
                пробуйте кухню, слушайте истории местных. А ещё здорово вести «дневник впечатлений»: пару строк о лучшем 
                закате, вкусном завтраке или случайной встрече. Куда бы вы ни поехали, главное быть открытым 
                новому. Расскажите в комментариях, какое место вас по‑настоящему поразило?'''
             },
            {'name': 'Хобби и увлечения',
             'preview': 'blog/image/Hobbies_&_Hobbies.png',
             'created_at': '2000-05-10',
             'content': '''
                Хобби это маленькая вселенная, где можно быть собой и не бояться ошибаться. Кто-то собирает редкие 
                пластинки, кто-то вяжет свитера, а кто-то учится играть на укулеле в 40 лет и это круто! Увлечения 
                помогают перезагрузиться после рабочего дня и найти единомышленников. Попробуйте что-то новое хотя бы 
                на 30 минут: скетчинг, кулинарный эксперимент, сборку пазла. Главное не результат, а удовольствие от 
                процесса. А какое хобби греет вашу душу? Поделитесь в комментариях соберём коллекцию вдохновляющих идей!'''
             },
            {'name': 'Карьера и работа',
             'preview': 'blog/image/Career_&_Jobs.jpg',
             'created_at': '2000-05-10',
             'content': '''
                Карьера это не только про должность и зарплату, а про рост, смыслы и баланс. Не бойтесь менять вектор: 
                иногда горизонтальный переход или освоение смежной ниши даёт больше, чем погоня за повышением. 
                Развивайте не только «жёсткие» навыки, но и умение договариваться, слышать обратную связь, управлять 
                энергией. Фиксируйте даже небольшие победы они помогают видеть прогресс. И помните: стабильная работа 
                важна, но не менее ценно чувствовать, что вы двигаетесь туда, где интересно. А какой карьерный совет вы 
                бы дали себе в начале пути? Поделитесь в комментариях соберём коллекцию мудрых мыслей! '''
             },

        ]

        for entry in entrys:
            entry_, created = BlogEntry.objects.get_or_create(**entry)

            str_ = 'Запись добавлена:' if created else 'Что-то пошло не так:'
            self.stdout.write(self.style.SUCCESS(f'{str_} {entry_.name}'))
