from django.core.management.base import BaseCommand

from blog.models import BlogEntry


class Command(BaseCommand):
    help = 'Добавление данных в базу'

    def handle(self, *args, **kwargs):

        BlogEntry.objects.all().delete()

        entrys = [
            {'name': 'Декор для стены',
             'preview': 'blog/image/wall_decor.jpg',
             'content': 'Создают явный рельеф и глубину. Подойдут, чтобы сделать акцентную зону. Панели бывают '
                        'из гипса, полиуретана, дюрополимера — у каждого свои нюансы монтажа и ухода.',
             'created_at': '2000-05-10'
             },
            {'name': 'Здоровье и фитнес',
             'preview': 'blog/image/Health_&_Fitness.PNG',
             'content': 'Например, приседания и планка: как держать корпус, колени, стопы, дыхание. '
                        'Сюда же — модификации под разный уровень (приседания у стены, планка на коленях).',
             'created_at': '2000-05-10'
             },
            {'name': 'Технологии и гаджеты',
             'preview': 'blog/image/Technologies_and_gadgets.png',
             'content': 'Здесь есть интересные ниши: генераторы волн Шумана (для создания фонового звука,'
                        ' способствующего расслаблению), устройства для биологической обратной связи (помогают'
                        ' научиться контролировать дыхание или уровень стресса). Можно разобрать, есть ли у таких '
                        'гаджетов научная база или это скорее тренд.',
             'created_at': '2000-05-10'
             },
            {'name': 'Путешествия и туризм',
             'preview': 'blog/image/Travel_&_Tourism.jpg',
             'content': 'Например, «не-туристические» районы Стамбула, Праги или Тбилиси, где можно почувствовать'
                        ' «настоящую» атмосферу и сэкономить.',
             'created_at': '2000-05-10'
             },
            {'name': 'Хобби и увлечения',
             'preview': 'blog/image/Hobbies_&_Hobbies.png',
             'content': 'Можно начать с простого карандаша или акварели, а можно сразу в цифре — в Procreate,'
                        ' Krita, Photoshop. Если любишь чёткие формы и интерфейсы, это даже близко к твоей '
                        'фронтенд-работе: тут тоже про композицию и визуал.',
             'created_at': '2000-05-10'
             },
            {'name': 'Карьера и работа',
             'preview': 'blog/image/Career_&_Jobs.jpg',
             'content': 'Ты уже делаешь фронтенд и бэкенд — логично собрать это в единую роль. Тут важно держать '
                        'баланс: не «всё по чуть‑чуть», а иметь понятную зону ответственности (например, '
                        'бэкенд — основная экспертиза, фронтенд — уверенно).',
             'created_at': '2000-05-10'
             },

        ]

        for entry in entrys:
            entry_, created = BlogEntry.objects.get_or_create(**entry)

            str_ = 'Запись добавлена:' if created else 'Что-то пошло не так:'
            self.stdout.write(self.style.SUCCESS(f'{str_} {entry_.name}'))
